rule:setValue('身份配置', {
    [4] = {
        { 身份 = '主公', 人数 = 1 },
        { 身份 = '忠臣', 人数 = 1 },
        { 身份 = '反贼', 人数 = 1 },
        { 身份 = '内奸', 人数 = 1 },
    },
    [5] = {
        { 身份 = '主公', 人数 = 1 },
        { 身份 = '忠臣', 人数 = 1 },
        { 身份 = '反贼', 人数 = 2 },
        { 身份 = '内奸', 人数 = 1 },
    },
    [6] = {
        { 身份 = '主公', 人数 = 1 },
        { 身份 = '忠臣', 人数 = 1 },
        { 身份 = '反贼', 人数 = 3 },
        { 身份 = '内奸', 人数 = 1 },
    },
    [7] = {
        { 身份 = '主公', 人数 = 1 },
        { 身份 = '忠臣', 人数 = 2 },
        { 身份 = '反贼', 人数 = 3 },
        { 身份 = '内奸', 人数 = 1 },
    },
    [8] = {
        { 身份 = '主公', 人数 = 1 },
        { 身份 = '忠臣', 人数 = 2 },
        { 身份 = '反贼', 人数 = 4 },
        { 身份 = '内奸', 人数 = 1 },
    },
})
